Tekla Open API Reference for Tekla Structures 2025
RebarCrankingNullable Class
 The RebarCrankingNullable class represents the cranking of reinforcing bars at a RebarEndDetailModifier.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarCrankingNullable
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarCrankingNullable
<SerializableAttribute>
Public Class RebarCrankingNullable
The RebarCrankingNullable type exposes the following members.
Constructors
Name | Description
RebarCrankingNullable
 Initializes a new instance of the RebarCrankingNullable class.
Top
Properties
Name | Description
CrankedDistance
 Gets or sets the cranked distance.
CrankedLengthType
 Gets or sets the cranked length type.
CrankedOffset
 Gets or sets the cranked offset.
CrankedRatio
 Gets or sets the cranked ratio.
CrankingType
 Gets or sets the cranking type.
CrankRotation
 Gets or sets the crank rotation.
CrankStraightLength
 Gets or sets the crank straight length.
Top
See Also
Reference
Tekla.Structures.Model Namespace